# Config where apps go
cask_args appdir: '/Applications'

# Install cli commands
brew 'git'
brew 'wget'
brew 'bash-completion'
brew 'tree'
brew 'stow'
brew 'ansible'
brew 'nmap'
brew 'logrotate'
#   Python
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ipython'
#   Terraform
brew 'tfenv'
brew 'terraform-docs'
brew 'terragrunt'
#   Kubernetes
brew 'kubernetes-cli'
brew 'kubectx'
brew 'helm'
#   Docker
brew 'docker'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'

# install packages
tap 'homebrew/cask-cask' || true

# Install apps
#   Google
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-backup-and-sync'
#   Dev
cask 'firefox'
cask 'visual-studio-code'
#   Communication Apps
cask 'slack'
cask 'microsoft-teams'
#   Mac Apps
cask 'iterm2'
cask 'alfred'
cask 'sensiblesidebuttons'
cask 'rectangle'


# Remove outdated versions from the cellar.
cleanup
